### import the packages

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings("ignore")

### Load the dataset

In [2]:
df_train = pd.read_csv('LOAN PREDICTION.csv')
df_train.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [3]:
train_original = df_train.copy()

In [4]:
df_train.dtypes

Loan_ID               object
Gender                object
Married               object
Dependents            object
Education             object
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area         object
Loan_Status           object
dtype: object

In [5]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [6]:
df_train.isna().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [7]:
df_train.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [8]:
df_train.shape

(614, 13)

In [9]:
df_train.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [10]:
df_train['Education'].value_counts()

Graduate        480
Not Graduate    134
Name: Education, dtype: int64

In [11]:
df_train.tail()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
609,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
610,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
613,LP002990,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [12]:
df = df_train.fillna(method= "bfill")

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             614 non-null    object
 2   Married            614 non-null    object
 3   Dependents         614 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      614 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         614 non-null    float64
 9   Loan_Amount_Term   614 non-null    float64
 10  Credit_History     614 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [14]:
df['Education'].value_counts()

Graduate        480
Not Graduate    134
Name: Education, dtype: int64

In [15]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,128.0,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [16]:
df['Self_Employed'].value_counts()

No     528
Yes     86
Name: Self_Employed, dtype: int64

In [17]:
 df['Property_Area'].value_counts()

Semiurban    233
Urban        202
Rural        179
Name: Property_Area, dtype: int64

In [18]:
df['Married'].value_counts()

Yes    399
No     215
Name: Married, dtype: int64

In [19]:
df['Education'].value_counts()

Graduate        480
Not Graduate    134
Name: Education, dtype: int64

In [20]:
df['Gender'].value_counts()

Male      501
Female    113
Name: Gender, dtype: int64

In [21]:
df['Loan_Status'].value_counts()

Y    422
N    192
Name: Loan_Status, dtype: int64

In [22]:
#converting categorical feature into numeric
job   = {'No': 0, 'Yes': 1}
area  = {'Rural': 0, 'Semiurban': 1, 'Urban': 2}
loan  = {'N': 0, 'Y': 1}
grade = {'Not Graduate': 0, 'Graduate': 1}
union = {'No': 0, 'Yes': 1}


data = [df]

for dataset in data:
    dataset['Self_Employed'] = dataset['Self_Employed'].map(job)
    dataset['Married']       = dataset['Married'].map(union)
    dataset['Education']     = dataset['Education'].map(grade)
    dataset['Loan_Status']   = dataset['Loan_Status'].map(loan)
    dataset['Property_Area'] = dataset['Property_Area'].map(area)

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             614 non-null    object
 2   Married            614 non-null    int64
 3   Dependents         614 non-null    object
 4   Education          614 non-null    int64
 5   Self_Employed      614 non-null    int64
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         614 non-null    float64
 9   Loan_Amount_Term   614 non-null    float64
 10  Credit_History     614 non-null    float64
 11  Property_Area      614 non-null    int64
 12  Loan_Status        614 non-null    int64
dtypes: float64(4), int64(6), object(3)
memory usage: 62.5+ KB

In [24]:
df = pd.get_dummies(df, columns= ['Gender'], drop_first=True)

In [25]:
df.head()

,Loan_ID,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Gender_Male
0,LP001002,0,0,1,0,5849,0.0,128.0,360.0,1.0,2,1,1
1,LP001003,1,1,1,0,4583,1508.0,128.0,360.0,1.0,0,0,1
2,LP001005,1,0,1,1,3000,0.0,66.0,360.0,1.0,2,1,1
3,LP001006,1,0,0,0,2583,2358.0,120.0,360.0,1.0,2,1,1
4,LP001008,0,0,1,0,6000,0.0,141.0,360.0,1.0,2,1,1

In [26]:
df['Dependents'].value_counts()

0     354
2     105
1     104
3+     51
Name: Dependents, dtype: int64

In [27]:
df.tail()

,Loan_ID,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Gender_Male
609,LP002978,0,0,1,0,2900,0.0,71.0,360.0,1.0,0,1,0
610,LP002979,1,3+,1,0,4106,0.0,40.0,180.0,1.0,0,1,1
611,LP002983,1,1,1,0,8072,240.0,253.0,360.0,1.0,2,1,1
612,LP002984,1,2,1,0,7583,0.0,187.0,360.0,1.0,2,1,1
613,LP002990,0,0,1,1,4583,0.0,133.0,360.0,0.0,1,0,0

In [28]:
df['Dependents'] = df['Dependents'].astype('category')

cat_columns = df.select_dtypes(['category']).columns

df[cat_columns] = df[cat_columns].apply(lambda x: x.cat.codes)

In [29]:
#cat_columns

In [30]:
df.tail()

,Loan_ID,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Gender_Male
609,LP002978,0,0,1,0,2900,0.0,71.0,360.0,1.0,0,1,0
610,LP002979,1,3,1,0,4106,0.0,40.0,180.0,1.0,0,1,1
611,LP002983,1,1,1,0,8072,240.0,253.0,360.0,1.0,2,1,1
612,LP002984,1,2,1,0,7583,0.0,187.0,360.0,1.0,2,1,1
613,LP002990,0,0,1,1,4583,0.0,133.0,360.0,0.0,1,0,0

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Married            614 non-null    int64
 2   Dependents         614 non-null    int8
 3   Education          614 non-null    int64
 4   Self_Employed      614 non-null    int64
 5   ApplicantIncome    614 non-null    int64
 6   CoapplicantIncome  614 non-null    float64
 7   LoanAmount         614 non-null    float64
 8   Loan_Amount_Term   614 non-null    float64
 9   Credit_History     614 non-null    float64
 10  Property_Area      614 non-null    int64
 11  Loan_Status        614 non-null    int64
 12  Gender_Male        614 non-null    uint8
dtypes: float64(4), int64(6), int8(1), object(1), uint8(1)
memory usage: 54.1+ KB

### Creating new features

In [32]:
df['Total_Income'] = df['ApplicantIncome'] + df['CoapplicantIncome']

df['Total_Income'] = np.log(df['Total_Income'])

In [33]:
df.head()

,Loan_ID,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Gender_Male,Total_Income
0,LP001002,0,0,1,0,5849,0.0,128.0,360.0,1.0,2,1,1,8.674026
1,LP001003,1,1,1,0,4583,1508.0,128.0,360.0,1.0,0,0,1,8.714568
2,LP001005,1,0,1,1,3000,0.0,66.0,360.0,1.0,2,1,1,8.006368
3,LP001006,1,0,0,0,2583,2358.0,120.0,360.0,1.0,2,1,1,8.505323
4,LP001008,0,0,1,0,6000,0.0,141.0,360.0,1.0,2,1,1,8.699515

In [34]:
df['Monthly_Amount_Paid'] = df['LoanAmount'] / df['Loan_Amount_Term']

In [35]:
df.head()

,Loan_ID,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Gender_Male,Total_Income,Monthly_Amount_Paid
0,LP001002,0,0,1,0,5849,0.0,128.0,360.0,1.0,2,1,1,8.674026,0.355556
1,LP001003,1,1,1,0,4583,1508.0,128.0,360.0,1.0,0,0,1,8.714568,0.355556
2,LP001005,1,0,1,1,3000,0.0,66.0,360.0,1.0,2,1,1,8.006368,0.183333
3,LP001006,1,0,0,0,2583,2358.0,120.0,360.0,1.0,2,1,1,8.505323,0.333333
4,LP001008,0,0,1,0,6000,0.0,141.0,360.0,1.0,2,1,1,8.699515,0.391667

In [36]:
#df['Balanced_Income'] = df['Total_Income'] - (df['Monthly_Amount_Paid'] * 1000) # Multiply by 1000 to make the units equal

In [37]:
df['Balanced_Income'] = df['Total_Income'] - df['Monthly_Amount_Paid']

In [38]:
df = df.drop(['ApplicantIncome', 'CoapplicantIncome', 'LoanAmount', 'Loan_Amount_Term', 'Loan_ID'], axis=1)

In [39]:
df.head()

,Married,Dependents,Education,Self_Employed,Credit_History,Property_Area,Loan_Status,Gender_Male,Total_Income,Monthly_Amount_Paid,Balanced_Income
0,0,0,1,0,1.0,2,1,1,8.674026,0.355556,8.318470
1,1,1,1,0,1.0,0,0,1,8.714568,0.355556,8.359012
2,1,0,1,1,1.0,2,1,1,8.006368,0.183333,7.823034
3,1,0,0,0,1.0,2,1,1,8.505323,0.333333,8.171990
4,0,0,1,0,1.0,2,1,1,8.699515,0.391667,8.307848

In [40]:
df.shape

(614, 11)

In [41]:
# separate training features from target
X_train = df.drop(['Loan_Status'], axis= 1)
y_train = df['Loan_Status']

In [42]:
X_train.head()

,Married,Dependents,Education,Self_Employed,Credit_History,Property_Area,Gender_Male,Total_Income,Monthly_Amount_Paid,Balanced_Income
0,0,0,1,0,1.0,2,1,8.674026,0.355556,8.318470
1,1,1,1,0,1.0,0,1,8.714568,0.355556,8.359012
2,1,0,1,1,1.0,2,1,8.006368,0.183333,7.823034
3,1,0,0,0,1.0,2,1,8.505323,0.333333,8.171990
4,0,0,1,0,1.0,2,1,8.699515,0.391667,8.307848

In [43]:
y_train.head()

0    1
1    0
2    1
3    1
4    1
Name: Loan_Status, dtype: int64

In [ ]:
# Standardize the data
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaler.fit(X_train)
X_train = scaler.transform(X_train)
X_test  = scaler.transform(X_test)

In [44]:
# import preprocessing module
from sklearn.preprocessing import MinMaxScaler

# scale our data into range of 0 and 1
scaler  = MinMaxScaler(feature_range=(0, 1))
X_train = scaler.fit_transform(X_train)

In [45]:
X_train

array([[0.        , 0.        , 1.        , ..., 0.34759045, 0.03583258,
        0.80930235],
       [1.        , 0.33333333, 1.        , ..., 0.35765434, 0.03583258,
        0.81309624],
       [1.        , 0.        , 1.        , ..., 0.18185333, 0.0171635 ,
        0.76293929],
       ...,
       [1.        , 0.33333333, 1.        , ..., 0.43482806, 0.07347185,
        0.80969607],
       [1.        , 0.66666667, 1.        , ..., 0.4120421 , 0.05359831,
        0.81826259],
       [0.        , 0.        , 1.        , ..., 0.2870414 , 0.03733815,
        0.78517681]])

In [46]:
X_train.shape, y_train.shape

((614, 10), (614,))

In [47]:
np.unique(y_train)

array([0, 1], dtype=int64)

In [48]:
# split the training dataset
from sklearn.model_selection import train_test_split

#split the dataset into 70% train and 30% test and perform a stratified sampling (stratify= y_test) so that the proportion of values in /n
#the sample produced will be the same as the proportion of values provided in the target variable 

X_train, X_test, y_train, y_test = train_test_split(X_train, y_train, stratify = y_train, test_size = 0.3, random_state=42)

In [50]:
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((429, 10), (185, 10), (429,), (185,))

### Model Setup

In [52]:
#import classifier algorithm here 
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.ensemble import ExtraTreesClassifier
from sklearn.tree import DecisionTreeClassifier 

#import evaluation metrics
from sklearn.metrics import accuracy_score, f1_score, classification_report, precision_score, recall_score

# create models 
lg_model = LogisticRegression()
rf_model = RandomForestClassifier()
kn_model = KNeighborsClassifier()
et_model = ExtraTreesClassifier()
dt_model = DecisionTreeClassifier()

#fitting the models
lg_model.fit(X_train, y_train)
rf_model.fit(X_train, y_train)
kn_model.fit(X_train, y_train)
et_model.fit(X_train, y_train)
dt_model.fit(X_train, y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

### Evaluating the Models

In [ ]:
#Score the model

In [53]:
lg_model.score(X_train, y_train)

0.7878787878787878

In [54]:
rf_model.score(X_train, y_train)

1.0

In [55]:
kn_model.score(X_train, y_train)

0.7995337995337995

In [56]:
et_model.score(X_train, y_train)

1.0

In [57]:
dt_model.score(X_train, y_train)

1.0

In [58]:
# evaluate the model

lg_pred = lg_model.predict(X_test)

rf_pred = rf_model.predict(X_test)

kn_pred = kn_model.predict(X_test)

et_pred = et_model.predict(X_test)

dt_pred = dt_model.predict(X_test)

#### Logistic Regression Model

In [60]:
from sklearn.metrics import confusion_matrix
con_matrix = confusion_matrix(y_test, lg_pred, labels= y_test.unique())
pd.DataFrame(con_matrix, index= y_test.unique(), columns= y_test.unique())

     1   0
1  123   4
0   26  32

In [61]:
report = classification_report(y_test, lg_pred)
print(report)
print('accuracy_score for Logistic is:', accuracy_score(y_test, lg_pred))
print('f1_score for Logistic is:', f1_score(y_test, lg_pred))
print('precision for Logistic is:', precision_score(y_test, lg_pred))
print('recall_score for Logistic is:', recall_score(y_test, lg_pred))

              precision    recall  f1-score   support

           0       0.89      0.55      0.68        58
           1       0.83      0.97      0.89       127

    accuracy                           0.84       185
   macro avg       0.86      0.76      0.79       185
weighted avg       0.85      0.84      0.83       185

accuracy_score for Logistic is: 0.8378378378378378
f1_score for Logistic is: 0.8913043478260869
precision for Logistic is: 0.825503355704698
recall_score for Logistic is: 0.968503937007874

#### RandomForest Model

In [62]:
con_matrix = confusion_matrix(y_test, rf_pred, labels= y_test.unique())
pd.DataFrame(con_matrix, index= y_test.unique(), columns= y_test.unique())

     1   0
1  111  16
0   21  37

In [63]:
report = classification_report(y_test, rf_pred)
print(report)
print('accuracy_score for RandonForest is:', accuracy_score(y_test, rf_pred))
print('f1_score for RandonForest is:', f1_score(y_test, rf_pred))
print('precision for RandonForest is:', precision_score(y_test, rf_pred))
print('recall_score for RandonForest is:', recall_score(y_test, rf_pred))

              precision    recall  f1-score   support

           0       0.70      0.64      0.67        58
           1       0.84      0.87      0.86       127

    accuracy                           0.80       185
   macro avg       0.77      0.76      0.76       185
weighted avg       0.80      0.80      0.80       185

accuracy_score for RandonForest is: 0.8
f1_score for RandonForest is: 0.8571428571428572
precision for RandonForest is: 0.8409090909090909
recall_score for RandonForest is: 0.8740157480314961

#### KNeighbors Model

In [64]:
con_matrix = confusion_matrix(y_test, kn_pred, labels= y_test.unique())
pd.DataFrame(con_matrix, index= y_test.unique(), columns= y_test.unique())

     1   0
1  114  13
0   25  33

In [65]:
report = classification_report(y_test, kn_pred)
print(report)
print('accuracy_score for KNeighbors is:', accuracy_score(y_test, kn_pred))
print('f1_score for KNeighbors is:', f1_score(y_test, kn_pred))
print('precision for KNeighbors is:', precision_score(y_test, kn_pred))
print('recall_score for KNeighbors is:', recall_score(y_test, kn_pred))

              precision    recall  f1-score   support

           0       0.72      0.57      0.63        58
           1       0.82      0.90      0.86       127

    accuracy                           0.79       185
   macro avg       0.77      0.73      0.75       185
weighted avg       0.79      0.79      0.79       185

accuracy_score for KNeighbors is: 0.7945945945945946
f1_score for KNeighbors is: 0.8571428571428571
precision for KNeighbors is: 0.8201438848920863
recall_score for KNeighbors is: 0.8976377952755905

#### ExtraTrees

In [66]:
con_matrix = confusion_matrix(y_test, et_pred, labels= y_test.unique())
pd.DataFrame(con_matrix, index= y_test.unique(), columns= y_test.unique())

     1   0
1  107  20
0   23  35

In [67]:
report = classification_report(y_test, et_pred)
print(report)
print('accuracy_score for ExtraTrees is:', accuracy_score(y_test, et_pred))
print('f1_score for ExtraTrees is:', f1_score(y_test, et_pred))
print('precision for ExtraTrees is:', precision_score(y_test, et_pred))
print('recall_score for ExtraTrees is:', recall_score(y_test, et_pred))

              precision    recall  f1-score   support

           0       0.64      0.60      0.62        58
           1       0.82      0.84      0.83       127

    accuracy                           0.77       185
   macro avg       0.73      0.72      0.73       185
weighted avg       0.76      0.77      0.77       185

accuracy_score for ExtraTrees is: 0.7675675675675676
f1_score for ExtraTrees is: 0.8326848249027237
precision for ExtraTrees is: 0.823076923076923
recall_score for ExtraTrees is: 0.84251968503937

#### DecisionTree

In [68]:
con_matrix = confusion_matrix(y_test, dt_pred, labels= y_test.unique())
pd.DataFrame(con_matrix, index= y_test.unique(), columns= y_test.unique())

    1   0
1  91  36
0  21  37

In [69]:
report = classification_report(y_test, dt_pred)
print(report)
print('accuracy_score for ExtraTrees is:', accuracy_score(y_test, et_pred))
print('f1_score for ExtraTrees is:', f1_score(y_test, et_pred))
print('precision for ExtraTrees is:', precision_score(y_test, et_pred))
print('recall_score for ExtraTrees is:', recall_score(y_test, et_pred))

              precision    recall  f1-score   support

           0       0.51      0.64      0.56        58
           1       0.81      0.72      0.76       127

    accuracy                           0.69       185
   macro avg       0.66      0.68      0.66       185
weighted avg       0.72      0.69      0.70       185

accuracy_score for ExtraTrees is: 0.7675675675675676
f1_score for ExtraTrees is: 0.8326848249027237
precision for ExtraTrees is: 0.823076923076923
recall_score for ExtraTrees is: 0.84251968503937

##### Our best models are Logistic Regression (Accuracy of 84% and F1_score of 89%) and 
##### RandomForest (Accuracy of 80% and F1_score of 86% )

### Conclusion

In [ ]:
Sample = pd.read_csv('sample.csv')
Sample.head()